20230818062912-random_access_memory.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-31 Sat 10:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Random Access Memory (RAM)</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Random Access Memory (RAM)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org691d9a7">1. Bits and Bytes</a></li>
<li><a href="#org5d7bfff">2. Types</a>
<ul>
<li><a href="#orgdff1223">2.1. Dynamic Random Access Memory (DRAM).</a></li>
<li><a href="#org2dd276e">2.2. Synchronous Dynamic Random Access Memory (SDRAM).</a></li>
<li><a href="#org05e09b2">2.3. Double Data Rate SDRAM (DDR)</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org691d9a7" class="outline-2">
<h2 id="org691d9a7"><span class="section-number-2">1.</span> <a href="20260116075246-bits_and_bytes.html#ID-049093ad-96f5-491e-a3d9-b80f757109ab">Bits and Bytes</a></h2>
<div class="outline-text-2" id="text-1">
<p>
A computer’s <code>memory</code> consists of an ordered sequence of <a href="20260116075511-byte.html#ID-14267f9e-5fe8-441f-8e3a-3c77d5868bd0">Bytes</a> for storing <b>programs</b> as well as <b>data</b> with which the program is working.
</p>

<p>
You can think of <code>memory</code> as the computer’s work area for executing a program.
</p>

<p>
A <b>program</b> and its <b>data</b> must be moved into the computer’s <code>memory</code> before they can be executed by the <a href="20230818061710-central_processing_unit_cpu.html#ID-434b40ba-6fee-45ee-95e0-f8b79f751cdd">CPU</a>.
</p>

<p>
Every byte in the memory has a unique <code>address</code>.
</p>

<p>
The <code>address</code> is used to locate the <a href="20260116075511-byte.html#ID-14267f9e-5fe8-441f-8e3a-3c77d5868bd0">byte</a> for <b>storing</b> and <b>retrieving</b> the data.
</p>

<p>
Since the <a href="20260116075511-byte.html#ID-14267f9e-5fe8-441f-8e3a-3c77d5868bd0">bytes</a> in the memory can be accessed in any order, the memory is also referred to as <code>random-access memory (RAM)</code>.
</p>

<p>
A memory <a href="20260116075511-byte.html#ID-14267f9e-5fe8-441f-8e3a-3c77d5868bd0">byte</a> is never <b>empty</b>, but its initial content may be meaningless to your program.
</p>

<p>
The current content of a memory byte is lost whenever new information is placed in it.
</p>

<p>
Like the <a href="20230818061710-central_processing_unit_cpu.html#ID-434b40ba-6fee-45ee-95e0-f8b79f751cdd">CPU</a>, memory is built on <code>silicon semiconductor chips</code> that have millions of <b>transistors</b> embedded on their surface.
</p>

<p>
Compared to CPU chips, memory chips are less complicated, slower, and less expensive.
</p>
</div>
</div>

<div id="outline-container-org5d7bfff" class="outline-2">
<h2 id="org5d7bfff"><span class="section-number-2">2.</span> Types</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgdff1223" class="outline-3">
<h3 id="orgdff1223"><span class="section-number-3">2.1.</span> Dynamic Random Access Memory (DRAM).</h3>
<div class="outline-text-3" id="text-2-1">
<p>
When 1 or 0 is sent to DRAM, it stores each bit in a microscopic capacitor, this is either <b>charged (1)</b> or <b>discharged (0)</b>.
</p>

<p>
These semiconductors are put into chips that are on the RAM and store our data.
</p>

<p>
There are also different types of memory sticks that <code>DRAM</code> chips can be put on.
</p>

<p>
The more modern DIMM sticks which usually stands for Dual Inline Memory Module have different sizes of pins on them.
</p>
</div>
</div>

<div id="outline-container-org2dd276e" class="outline-3">
<h3 id="org2dd276e"><span class="section-number-3">2.2.</span> Synchronous Dynamic Random Access Memory (SDRAM).</h3>
<div class="outline-text-3" id="text-2-2">
<p>
After DRAM was created, RAM manufacturers built something <code>SDRAM</code>.
</p>

<p>
This type of RAM is <b>synchronized</b> to our system's <b>clock speed</b>, allowing quicker processing of data.
</p>
</div>
</div>

<div id="outline-container-org05e09b2" class="outline-3">
<h3 id="org05e09b2"><span class="section-number-3">2.3.</span> Double Data Rate SDRAM (DDR)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>DDR</code> is <b>faster</b>, takes up <b>less power</b>, and has a larger capacity than earlier <code>SDRAM</code> versions.
</p>

<p>
In today's system, we use another type of RAM called <code>DDR</code>.
</p>

<p>
Types:
</p>
<ul class="org-ul">
<li>DDR1</li>
<li>DDR2</li>
<li>DDR3</li>
<li>DDR4</li>
</ul>
</div>
</div>
</div>
</div>
</body>
</html>
